{
  "name": "FISICA TECNICA",
  "id": "unibs702997",
  "icon": "mdi-book-open-page-variant",
  "color": "#4a90e2",
  "chapters": [
    {
      "name": "Fondamenti di Termodinamica",
      "showTasks": true,
      "tasks": [
        {
          "name": "Energia: additività, scambi per interazione, conservazione, equazione di bilancio",
          "done": false
        },
        {
          "name": "Disponibilità adiabatica. Energia disponibile rispetto ad un serbatoio",
          "done": false
        },
        {
          "name": "Entropia: additività, scambi per interazione, generazione per irreversibilità",
          "done": false
        },
        {
          "name": "Diagrammi E-S",
          "done": false
        },
        {
          "name": "Interazioni fra sistemi: lavoro, calore, flusso di massa",
          "done": false
        },
        {
          "name": "Stati di equilibrio stabile: Temperatura e pressione",
          "done": false
        },
        {
          "name": "Sistemi semplici: Stati omogenei ed eterogenei, fasi, regola delle fasi",
          "done": false
        },
        {
          "name": "Stati bifase, diagrammi T-s, h-s, p-v, T-p",
          "done": false
        },
        {
          "name": "Liquidi e solidi incomprimibili ideali, gas ideali e perfetti",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Focus on non-equilibrium states and energy balance equations."
        }
      ],
      "links": []
    },
    {
      "name": "Termodinamica Applicata",
      "showTasks": true,
      "tasks": [
        {
          "name": "Bilanci di energia ed entropia per sistemi aperti",
          "done": false
        },
        {
          "name": "Applicazione a componenti di impianti: pompe, compressori, turbine",
          "done": false
        },
        {
          "name": "Rudimenti su cicli e schemi di impianti di conversione di energia",
          "done": false
        },
        {
          "name": "Efficienza termodinamica di apparati di conversione energetica",
          "done": false
        },
        {
          "name": "Concetto di exergia e cogenerazione",
          "done": false
        },
        {
          "name": "Proprietà dell'aria umida, umidificazione, deumidificazione",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Understand the efficiency of thermal machines and energy conversion cycles."
        }
      ],
      "links": []
    },
    {
      "name": "Scambio Termico per Conduzione, Irraggiamento e Convezione",
      "showTasks": true,
      "tasks": [
        {
          "name": "Scambio termico per conduzione: Legge di Fourier",
          "done": false
        },
        {
          "name": "Equazione generale della conduzione e integrazione in varie geometrie",
          "done": false
        },
        {
          "name": "Scambio termico per irraggiamento",
          "done": false
        },
        {
          "name": "Radiazione di corpo nero e leggi di Planck e Stefan-Boltzmann",
          "done": false
        },
        {
          "name": "Scambio termico per convezione e teorema di Buckingham",
          "done": false
        },
        {
          "name": "Numeri di Reynolds, Nusselt, Grashof",
          "done": false
        },
        {
          "name": "Convezione forzata in flussi interni ed esterni e naturale",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Study the principles of heat transfer through conduction, radiation, and convection."
        }
      ],
      "links": []
    }
  ],
  "links": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "postIts": [
    {
      "color": "#FFEB3B",
      "content": "I riferimenti bibliografici ai libri ed alle dispense qui indicati sono elencati in fondo alla voce. Il libro di testo per la prima parte (termodinamica) è \"Termodinamica\" di G.P. Beretta (2002). Per approfondimenti facoltativi consigliamo \"Thermodynamics. Foundations and Applications\" di E.P. Gyftopoulos e G.P. Beretta (2005).Il libro di testo per la seconda parte (trasmissione del calore) è \"Fondamenti di trasmissione del calore\" di G. Comini e G. Cortella (2013). Per approfondimenti facoltativi consigliamo \"A Heat Transfer Textbook\" di J.H. Lienhard IV e J.H. Lienhard V (2020), scaricabile liberamente dalla pagina https://ahtt.mit.edu/.Oltre agli esercizi proposti e/o svolti in alcuni dei testi consigliati è disponibile la raccolta di esercizi di esame svolti e commentati \"Raccolta di temi d'esame svolti di Fisica Tecnica\" di G.P. Beretta, A.M. Lezzi e M. Pilotelli (2020). Libri di testo:Beretta; Termodinamica; Ed. Cartolibreria SnoopyComini, Cortella; Fondamenti di trasmissione del calore; SGE; 9788889884225Beretta, Lezzi, Pilotelli; Raccolta di temi d'esame svolti di Fisica Tecnica; Ed. Cartolibreria Snoopy; 9788889252277Libri consigliati: Gyftopoulos, Beretta; Thermodynamics. Foundations and Applications; Dover; 0486439321Lienhard IV, Lienhard V; A heat transfer textbook; Phlogiston Press"
    },
    {
      "color": "#FFEB3B",
      "content": "La prova d'esame consiste in una prova scritta di 120 minuti di durata e composta da due parti.(1) domande in forma aperta o chiusa volte a verificare che lo studente abbia acquisito idonea conoscenza e comprensione degli argomenti di termodinamica e di scambio termico presentati e sviluppati durante il corso; il peso di questa parte sulla valutazione finale è pari, di norma, al 25%.(2) tre o quattro problemi di termodinamica e di scambio termico, di norma articolati in una serie di domande atte a fornire una guida alla risoluzione; l'obbiettivo è quello di verificare la capacità dello studente di applicare le conoscenze acquisite per impostare e risolvere semplici problemi applicativi; il peso di questa parte sulla valutazione finale è pari, di norma, al 75%.Materiale consentito o richiesto durante la prova: calcolatrice non programmabile, penne e matite, documento di identificazione (tabelle e grafici, se necessari per lo svolgimento, vengono forniti insieme ai testi dei problemi proposti)."
    }
  ]
}