{
  "id": "unibs702995",
  "universityId": "unibs",
  "course": "CORSO DI LAUREA IN INGEGNERIA MECCANICA E DEI MATERIALI",
  "name": "SCIENZA DELLE COSTRUZIONI",
  "lastUpdated": "2024-08-26T15:18:02.175Z",
  "deleted": null,
  "goals": "Il corso si propone come obiettivi formativi specifici l'apprendimento di conoscenze, metodologie, strumenti di analisi critica dei seguenti modelli strutturali:- travi nel piano- continui tridimensionali per materiali solidi elasticiConoscenza e comprensione: Circa i sistemi di travi, l'insegnamento intende fornire allo studente gli strumenti per l'analisi di atti di moto rigido, di atti di moto per modelli di travi e continui di Cauchy, la determinazione di equazioni di bilancio a partire dall'assioma delle potenze virtuali e di oggettività, lo studio delle condizioni al contorno, dei legami costitutivi elastico lineari a partire da nozioni sperimentali e basilari di termo-meccanica dei continui, la scrittura delle equazioni governanti per i modelli indicati.Capacità di applicare conoscenza e comprensione: Le competenze acquisite verranno applicate alla soluzione di problemi. Per modelli di travi, con il metodo della linea elastica e delle equazioni di Mueller-Bresslau, anche in caso di sistemi iperstatici, nonché lo studio della stabilità dell'equilibrio elastico. Per i continui di Cauchy il corso prevede un'approfondita analisi di soluzioni particolari, note come Casi di De Saint Venant (tenso-presso-flessione, taglio, torsione). A seguito del superamento dell’esame, lo studente sarà in grado di determinare quale modello sia più appropriato per il caso di studio da risolvere, valutare la soluzione con i metodi appresi, valutarla criticamente alla luce di risultati attesi e test controllabili.",
  "chapters": [
    {
      "name": "Principi e metodi della meccanica dei solidi e delle strutture",
      "showTasks": true,
      "tasks": [
        {
          "name": "Studiare modelli tridimensionali della cinematica di mezzi continui",
          "done": false
        },
        {
          "name": "Analizzare il caso speciale di atti di moto rigidi",
          "done": false
        },
        {
          "name": "Comprendere principi fondamentali dell'analisi cinematica",
          "done": false
        },
        {
          "name": "Studiare equazioni di bilancio della quantità di moto",
          "done": false
        },
        {
          "name": "Studiare equazioni di bilancio del momento angolare",
          "done": false
        },
        {
          "name": "Illustrare modelli strutturali (funi e travi piane in piccoli spostamenti)",
          "done": false
        },
        {
          "name": "Approfondire i mezzi continui di Cauchy",
          "done": false
        },
        {
          "name": "Descrivere equazioni di bilancio nel quadro delle deformazioni finite",
          "done": false
        },
        {
          "name": "Limitare legami costitutivi ed equazioni governanti a piccole deformazioni",
          "done": false
        },
        {
          "name": "Studiare casi di De Saint Venant",
          "done": false
        },
        {
          "name": "Partecipare alle esercitazioni in aula e studio personale",
          "done": false
        },
        {
          "name": "Completare homework specifici",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Prepararsi per ore di esercitazione sia in aula che in studio personale."
        },
        {
          "color": "#e6b905",
          "content": "Focalizzarsi sui casi di De Saint Venant per esempi pratici."
        }
      ],
      "links": []
    },
    {
      "name": "Modelli della scienza delle costruzioni",
      "showTasks": true,
      "tasks": [
        {
          "name": "Studiare il modello di trave, 2D e 3D",
          "done": false
        },
        {
          "name": "Comprendere la stabilità dell'equilibrio elastico",
          "done": false
        },
        {
          "name": "Studiare il continuo di Cauchy",
          "done": false
        },
        {
          "name": "Esaminare elementi essenziali di termodinamica dei materiali",
          "done": false
        },
        {
          "name": "Esplorare soluzioni particolari e casi di De Saint Venant",
          "done": false
        },
        {
          "name": "Introduzione alla meccanica computazionale",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Approfondire i diversi modelli strutturali e le loro applicazioni."
        }
      ],
      "links": []
    }
  ],
  "urls": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "icon": "mdi-book-open",
  "color": "#4A90E2",
  "examMode": "L'esame consta di una prova scritta, in cui viene verificato il raggiungimentodegli obiettivi formativi e dei risultati dell’apprendimento attesi per il modello di trave, e di una prova orale, in cui viene verificato il raggiungimentodegli obiettivi formativi e dei risultati dell’apprendimento attesi per il modello di continuo di Cauchy.Gli homework, che consentono di valutare la capacità di lavorare in gruppo su applicazioni pratiche dei contenuti delle lezioni, verranno valutati a parte.",
  "requirements": "Analisi Matematica 2 e Meccanica Razionale.",
  "cfu": "9 CFU",
  "language": "ITALIANO",
  "teachers": [
    {
      "name": "SERPELLONI MATTIA"
    },
    {
      "name": "BONANNO CLAUDIA"
    },
    {
      "name": "CABRAS LUIGI"
    }
  ],
  "books": {
    "books": [
      {
        "name": "Appunti di scienza delle costruzioni",
        "authors": [
          "Alberto Salvadori"
        ],
        "year": 2004,
        "notes": []
      },
      {
        "name": "Esercizi di scienza delle costruzioni",
        "authors": [
          "Alfredo Castiglioni",
          "Vincenzo Petrini",
          "Carlo Urbano"
        ],
        "year": 1986,
        "notes": [
          "2nd edition"
        ]
      },
      {
        "name": "Scienza delle costruzioni",
        "authors": [
          "Luciano Nunziante",
          "Antonio Tralli",
          "Luigi Gambarotta"
        ],
        "year": 2011,
        "notes": [
          "3rd edition"
        ]
      },
      {
        "name": "Meccanica dei solidi : elementi di scienza delle costruzioni",
        "authors": [
          "Massimo Cuomo",
          "Ferdinand P. Beer",
          "E. Russell Johnston"
        ],
        "year": 2018,
        "notes": [
          "5th Italian edition edited by Massimo Cuomo"
        ]
      },
      {
        "name": "Lezioni di scienza delle costruzioni",
        "authors": [
          "Paolo Podio-Guidugli"
        ],
        "year": 2009,
        "notes": [
          "2nd revised and expanded edition with 340 figures and 95 exercises"
        ]
      },
      {
        "name": "Scienza delle costruzioni",
        "authors": [
          "Paolo Casini",
          "Marcello Vasta"
        ],
        "year": 2020,
        "notes": [
          "4th edition"
        ]
      }
    ]
  }
}