{
  "id": "unibs703052",
  "universityId": "unibs",
  "name": "MECCANICA DEGLI AZIONAMENTI",
  "lastUpdated": "2024-08-26T14:53:56.668Z",
  "deleted": null,
  "goals": "II corso intende far acquisire le conoscenze e le competenze principali relativamente alle tecnologie di azionamento, con il focus principale sull’ambito industriale ma spaziando anche ad altri ambiti in cui l’automazione trova applicazione, come ad esempio sistemi di trasporto, domotici, biomedicali.Si faranno acquisire allo studente le conoscenze per la comprensione dei principi di funzionamento degli azionamenti elettrici, oleodinamici e pneumatici e le competenze per scegliere la tecnologia di azionamento più adatta alla movimentazione richiesta.Per gli azionamenti elettrici, al termine del corso lo studente dovrà essere in grado di scegliere e dimensionare l'azionamento elettrico più adatto ad una specifica movimentazione. Relativamente agli azionamenti pneumatici ed oleodinamici, il corso ha lo scopo di far acquisire le competenze per sviluppare il progetto funzionale del sistema. Gli obiettivi formativi declinati in funzione dei descrittori di Dublino sono:Knowledge and understanding Conoscere e comprendere il principio di funzionamento dei principali attuatori elettrici utilizzati nell’automazione, le loro caratteristiche funzionali, la struttura di un azionamento elettrico, le caratteristiche principali, prestazioni e campo operativo delle tipologie di azionamento elettrico utilizzate in ambito industriale, le possibilità di regolazione, le procedure di verifica del gruppo motore/riduttore Conoscere e comprendere gli aspetti di base delle tecnologie pneumatica ed oleodinamica di trasmissione della potenza, la tecnica circuitale, la struttura ed il ruolo dei componenti di un azionamento pneumatico ed oleodinamicoApplying Knowledge and understanding Capacità di operare con le diverse unità di misura delle grandezze fondamentali del settore ingegneristico. Capacità di confrontare dal punto di vista funzionale le diverse tecnologie di trasmissione della potenza (elettrica, oleodinamica e pneumatica)  Essere in grado di partecipare alla progettazione di sistemi di azionamento, con un approccio critico e metodico e capacità di astrazione e generalizzazioneMaking Judgements Essere in grado di identificare, formulare e risolvere problemi legati alla gestione di apparati, macchine e sistemi industriali e gestire progetti di media complessità. Essere in grado di raccogliere, integrare e interpretare criticamente i dati di progettazione e gestione in ambito industriale o i dati di natura sperimentale, per concorrere a determinare un giudizio sulla loro rilevanza e le implicazioni tecniche nella gestione, pervenendo a idee e giudizi originali e autonomi Essere in grado di integrare fra loro le conoscenze acquisite per adattarle ai diversi tempi e ambienti in cui potrà andare ad operare.Communication skills Capacità di esprimere concetti, interpretazioni e idee in forma orale e/o scritta e/o grafica Capacità di leggere, ed eventualmente produrre e/o redigere, norme interne aziendali e manuali tecniciLearning skills Capacità di consultare e utilizzare informazioni in rete (come cataloghi) per un aggiornamento continuo delle conoscenze",
  "chapters": [
    {
      "name": "Introduzione all'automazione",
      "showTasks": true,
      "tasks": [
        {
          "name": "Automazione nell'industria manifatturiera e di processo",
          "done": false
        },
        {
          "name": "Automazione rigida e flessibile",
          "done": false
        },
        {
          "name": "Sistemi automatici e integrazione delle tecnologie",
          "done": false
        },
        {
          "name": "Industria 4.0",
          "done": false
        }
      ],
      "postIts": [],
      "links": []
    },
    {
      "name": "Azionamenti Elettrici",
      "showTasks": true,
      "tasks": [
        {
          "name": "Introduzione agli azionamenti elettrici",
          "done": false
        },
        {
          "name": "Macchine elettriche",
          "done": false
        },
        {
          "name": "Problema termico delle macchine elettriche",
          "done": false
        },
        {
          "name": "Convertitori statici dell’energia elettrica",
          "done": false
        },
        {
          "name": "Accoppiamento motore-carico",
          "done": false
        },
        {
          "name": "Azionamenti elettrici generali",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Esplorare le curve caratteristiche delle macchine elettriche."
        },
        {
          "color": "#e6b905",
          "content": "Studiare i servizi standard S1, S2 e S3."
        }
      ],
      "links": []
    },
    {
      "name": "Azionamenti Pneumatici",
      "showTasks": true,
      "tasks": [
        {
          "name": "Introduzione alla tecnologia pneumatica",
          "done": false
        },
        {
          "name": "Componenti pneumatici",
          "done": false
        },
        {
          "name": "Tecnica circuitale pneumatica",
          "done": false
        },
        {
          "name": "Gestione dell’aria compressa",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Approfondire l'organizzazione di un sistema automatico con GRAFCET."
        }
      ],
      "links": []
    },
    {
      "name": "Azionamenti Oleodinamici",
      "showTasks": true,
      "tasks": [
        {
          "name": "Introduzione alla tecnologia oleodinamica",
          "done": false
        },
        {
          "name": "Componenti oleodinamici",
          "done": false
        },
        {
          "name": "Fluidi impiegati nei sistemi oleodinamici",
          "done": false
        },
        {
          "name": "Circuiti elementari oleodinamici",
          "done": false
        },
        {
          "name": "Confronto finale tra tecnologie",
          "done": false
        }
      ],
      "postIts": [],
      "links": []
    }
  ],
  "urls": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "icon": "mdi-cog",
  "color": "#4A90E2",
  "examMode": "La verifica di conoscenze e competenze acquisite consiste in:- prova scritta composta da 7 esercizi per verificare le competenze acquisite nella risoluzione di esercizi numerici su tematiche di progettazione e funzionamento di sistemi di azionamento. In dettaglio, sarà composta da un esercizio per ciascuno dei seguenti argomenti: azionamenti con motore asincrono trifase (5 punti), azionamenti con motore corrente continua (5 punti), azionamenti con motore brushless (6 punti), azionamenti con motore passo (4 punti),problema termico (3 punti), circuito pneumatico (4 punti) e circuito oleodinamico (4 punti).- prova orale: il cui obiettivo è verificare le conoscenze sugli aspetti teorici dei sistemi di azionamento. La prova orale può essere sostituita da un Test a risposte chiuse sugli argomenti teorici del corso. Si possono fare la parte teorica e la parte di esercizi in sessioni d'appello diverse. Il voto finale sarà la media tra i voti conseguiti nelle due prove. Il voto è espresso in trentesimi. Chi ha risposto ai quesiti proposti su Moodle durante il corso entro una data prestabilita avrà un incremento al voto finale variabile tra 1 e 3 punti.",
  "requirements": "La frequenza dell’insegnamento richiede la conoscenza dei contenuti dei seguenti corsi erogati nello stesso Corso di Studio: FISICA SPERIMENTALE (MECCANICA ED ELETTROMAGNETISMO) e MECCANICA DELLE MACCHINE E MACCHINE Nell’ambito del corso verranno ripassati alcuni concetti di base dell’accoppiamento motore/trasmissione/carico e dei fenomeni elettromagnetici e delle leggi che li descrivono, alla base del funzionamento dei motori elettrici.",
  "cfu": "9 CFU",
  "language": "ITALIANO",
  "teachers": [
    {
      "name": "BERTI FEDERICO"
    },
    {
      "name": "MOIOLA LUCIANO"
    },
    {
      "name": "BIGNOTTI GIANCARLO"
    },
    {
      "name": "LODA DAVIDE"
    }
  ],
  "books": {
    "books": [
      {
        "name": "Meccanica degli azionamenti",
        "authors": [
          "Giovanni Legnani"
        ],
        "year": 2016,
        "notes": [
          "3rd edition",
          "Covers electric drives, principles of operation, load coupling, selection of motor-reducer groups, laws of motion, and control."
        ]
      }
    ]
  }
}