{
  "id": "unibs703549",
  "universityId": "unibs",
  "name": "SOCIOLOGIA DELL ORGANIZZAZIONE",
  "lastUpdated": "2024-08-26T14:54:23.075Z",
  "deleted": null,
  "goals": "Al termine del corso lo studente avrà raggiunto una maggiore consapevolezza delle trasformazioni che hanno caratterizzato i modelli produttivi nell’industria (ma non solo) a partire dai primi decenni del ‘900, e che hanno riguardato sia la dimensione tecnologica che quella organizzativa delle imprese. Lo studente avrà una chiara percezione dei risvolti di questi cambiamenti sulle condizioni di lavoro, sulla vita degli occupati, sulle relazioni industriali. Oltre agli obiettivi cognitivi, il corso intende sviluppare specifiche capacità degli studenti utili ad operare in organizzazioni più flessibili e che richiedono una maggiore partecipazione/coinvolgimento dei lavoratori; in tale prospettiva lo studente vedrà incrementare le sue capacità decisionali e negoziali attraverso il ricorso a un laboratorio specifico (Progetto Università Sindacato Impresa al Lavoro) ed esercitazioni e simulazioni negoziali.",
  "chapters": [
    {
      "name": "Analisi dei modelli produttivi",
      "showTasks": true,
      "tasks": [
        {
          "name": "Fordismo e Neo-fordismo",
          "done": false
        },
        {
          "name": "Specializzazione flessibile",
          "done": false
        },
        {
          "name": "Produzione snella",
          "done": false
        },
        {
          "name": "Produzione personalizzata in grande scala",
          "done": false
        },
        {
          "name": "Industry 4.0",
          "done": false
        },
        {
          "name": "Tecnologia e organizzazione del lavoro",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#f39c12",
          "content": "Focus sul rapporto tra tecnologia e lavoro."
        },
        {
          "color": "#e74c3c",
          "content": "Considerare le nuove tendenze e modelli produttivi."
        }
      ],
      "links": []
    },
    {
      "name": "Parte generale",
      "showTasks": true,
      "tasks": [
        {
          "name": "Analisi del taylorismo e fordismo",
          "done": false
        },
        {
          "name": "Innovazioni del fordismo",
          "done": false
        },
        {
          "name": "Crisi del fordismo e neo-fordismo",
          "done": false
        },
        {
          "name": "Lean production e modello Toyota",
          "done": false
        },
        {
          "name": "Nuovi modelli produttivi e Industry 4.0",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#1abc9c",
          "content": "Include approfondimento su FIAT e Distretti Industriali."
        },
        {
          "color": "#3498db",
          "content": "Discussione sugli impatti sociali e lavorativi."
        }
      ],
      "links": []
    },
    {
      "name": "Progetto USIL",
      "showTasks": true,
      "tasks": [
        {
          "name": "Attività formativa iniziale",
          "done": false
        },
        {
          "name": "Visite nelle aziende",
          "done": false
        },
        {
          "name": "Lavori di gruppo",
          "done": false
        },
        {
          "name": "Presentazione delle proposte",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e67e22",
          "content": "Collaborazione tra studenti e delegati sindacali."
        },
        {
          "color": "#2ecc71",
          "content": "Viene richiesto un feedback dalle aziende."
        }
      ],
      "links": []
    },
    {
      "name": "Parte monografica",
      "showTasks": true,
      "tasks": [
        {
          "name": "Negoziati interni all'organizzazione",
          "done": false
        },
        {
          "name": "Negoziati tra organizzazioni",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#9b59b6",
          "content": "Focus sui processi negoziali nel moderno contesto lavorativo."
        }
      ],
      "links": []
    }
  ],
  "urls": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "icon": "mdi-clipboard-text",
  "color": "#8e44ad",
  "examMode": "La verifica della preparazione degli studenti avverrà attraverso un esame scritto composto da circa 15 domande, sia aperte (la maggior parte) con spazio di risposta predefinito, sia chiuse, con risposte preordinate tra cui scegliere. Il peso, in punti, di ciascuna di esse dipende dell'importanza del tema trattato e dall'estensione della risposta attesa. Il punteggio finale (in trentesimi) sarà dato dalla somma dei punteggi parziali. La durata della prova scritta è di un'ora e quarantacinque minuti. Per ottenere la lode sarà necessario sostenere una breve prova orale integrativa volta ad approfondire la comprensione degli argomenti trattati nel compito e gli eventuali collegamenti con altri temi affrontati nel corso.Gli argomenti oggetto d'esame, per gli studenti frequentanti rifletteranno quelli affrontati durante il corso (comprese le lezioni previste nell'ambito del progetto USIL), mentre per gli studenti non frequentanti riguarderanno quelli trattati nei testi indicati in bibliografia. L’esame scritto è finalizzato a verificare non tanto la conoscenza mnemonica, ma la piena comprensione degli argomenti studiati, il corretto uso di concetti e teorie, le capacità critiche dello studente. Per il superamento dell’esame è necessario un corretto utilizzo della terminologia propria della disciplina e una chiara e sintetica esposizione degli argomenti affrontati che sappia evidenziare, dove necessario, i collegamenti tra di essi.La partecipazione attiva al progetto USIL ed alle simulazioni negoziali darà adito ad un bonus, in termini di punti (max. 4), che concorrerà alla valutazione finale dello studente.",
  "requirements": "Per la fruizione dell’insegnamento non sono necessarie specifiche competenze e/o conoscenze pregresse diverse da quelle richieste per l’iscrizione al Corso di Studio.E' utile comunque, per gli studenti di Ingegneria gestionale, aver frequentato il corso di Organizzazione e gestione dell'innovazione.",
  "cfu": "6 CFU",
  "language": "ITALIANO",
  "teachers": [
    {
      "name": ""
    }
  ],
  "books": {
    "books": []
  }
}