{
  "id": "unibs703556",
  "universityId": "unibs",
  "course": "CORSO DI LAUREA IN INGEGNERIA MECCANICA E DEI MATERIALI",
  "name": "CALCOLO NUMERICO CON LABORATORIO",
  "lastUpdated": "2024-08-26T15:18:23.040Z",
  "deleted": null,
  "goals": "Il Calcolo Scientifico è al giorno d'oggi uno strumento molto importante per simulare il comportamento di dispositivi prima della costruzione di un prototipo e per ottimizzare le prestazioni di tali dispositivi. L'obiettivo del corso è quello di introdurre i metodi di base del calcolo scientifico a partire dalla soluzione dei sistemi lineari e non lineari, fino alla soluzione di sistemi di equazioni differenziali ordinarie e a qualche cenno sulla risoluzione di problemi complessi formulati matematicamente con equazioni alle derivate parziali. L'analisi dei metodi numerici presentati verrà discussa in modo da dare agli studenti degli strumenti di valutazione dei risultati numerici ottenuti in seguito all'applicazione di tali metodi a problemi pratici. Parte non secondaria saranno le esercitazioni che si svolgeranno in laboratorio durante le quali si svilupperanno programmi nell'ambiente MATLAB® per risolvere i problemi affrontati.Gli studenti impareranno dagli esempi a comprendere se i risultati numerici ottenuti sono significativi per il problema che devono risolvere.",
  "chapters": [
    {
      "name": "Elementi di programmazione in Matlab e rappresentazione dei numeri reali",
      "showTasks": true,
      "tasks": [
        {
          "name": "Assegnazione di variabili scalari e vettoriali",
          "done": false
        },
        {
          "name": "Operazioni aritmetiche ed operazioni con matrici e vettori",
          "done": false
        },
        {
          "name": "Uso di funzioni ed elementi di grafica",
          "done": false
        },
        {
          "name": "Istruzioni condizionali e cicli",
          "done": false
        },
        {
          "name": "Programmazione in Matlab",
          "done": false
        },
        {
          "name": "Rappresentazione dei numeri reali mediante un computer. Standard IEEE",
          "done": false
        },
        {
          "name": "Arrotondamento di un numero",
          "done": false
        },
        {
          "name": "Propagazione degli errori nelle operazioni aritmetiche",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Familiarizzare con il linguaggio Matlab e i suoi strumenti."
        }
      ],
      "links": []
    },
    {
      "name": "Equazioni e sistemi non lineari",
      "showTasks": true,
      "tasks": [
        {
          "name": "Metodi di bisezione, delle secanti e di Newton",
          "done": false
        },
        {
          "name": "Risultati di convergenza",
          "done": false
        },
        {
          "name": "Risoluzione di sistemi non lineari. Estensione del metodo Newton-Raphson",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Studiare vari metodi numerici per trovare zeri di funzioni."
        }
      ],
      "links": []
    },
    {
      "name": "Interpolazione e approssimazione di funzioni",
      "showTasks": true,
      "tasks": [
        {
          "name": "Interpolazione polinomiale. Polinomi di Lagrange",
          "done": false
        },
        {
          "name": "Stima dell'errore di approssimazione",
          "done": false
        },
        {
          "name": "Interpolazione con polinomi a tratti",
          "done": false
        },
        {
          "name": "Interpolazione trigonometrica e FFT",
          "done": false
        },
        {
          "name": "Approssimazioni di dati nel senso dei minimi quadrati lineari",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Conoscere diverse tecniche di interpolazione e come applicarle."
        }
      ],
      "links": []
    },
    {
      "name": "Integrazione e derivazione numerica",
      "showTasks": true,
      "tasks": [
        {
          "name": "Integrazione numerica: formula del punto medio, dei trapezi e di Simpson",
          "done": false
        },
        {
          "name": "Formule di quadratura interpolatorie",
          "done": false
        },
        {
          "name": "La formula di Simpson adattiva",
          "done": false
        },
        {
          "name": "Approssimazione delle derivate",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Comprendere le tecniche di integrazione numerica e i loro usi."
        }
      ],
      "links": []
    },
    {
      "name": "Equazioni differenziali ordinarie",
      "showTasks": true,
      "tasks": [
        {
          "name": "Esistenza, unicità e dipendenza continua dai dati per la soluzione di un problema di Cauchy",
          "done": false
        },
        {
          "name": "Metodo di Eulero esplicito ed analisi della convergenza",
          "done": false
        },
        {
          "name": "Consistenza, 0-stabilità e convergenza",
          "done": false
        },
        {
          "name": "Regione di stabilità assoluta e sua influenza sulle perturbazioni",
          "done": false
        },
        {
          "name": "Risoluzione di sistemi di equazioni differenziali del primo ordine e di equazioni differenziali di ordine superiore",
          "done": false
        },
        {
          "name": "Risoluzione di equazioni differenziali con valori ai limiti",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Fare pratica con la risoluzione di ODE e i relativi metodi numerici."
        }
      ],
      "links": []
    },
    {
      "name": "Sistemi lineari",
      "showTasks": true,
      "tasks": [
        {
          "name": "Metodo di eliminazione di Gauss e fattorizzazione LU di una matrice",
          "done": false
        },
        {
          "name": "Analisi degli errori",
          "done": false
        },
        {
          "name": "Metodi iterativi. Definizioni e convergenza. Metodi di Jacobi, di Gauss-Seidel",
          "done": false
        },
        {
          "name": "Metodi di Richardson stazionari e non stazionari",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Approfondire il funzionamento dei metodi per la risoluzione di sistemi lineari."
        }
      ],
      "links": []
    },
    {
      "name": "Autovalori e autovettori",
      "showTasks": true,
      "tasks": [
        {
          "name": "Definizioni. Proprietà di autovalori ed autovettori",
          "done": false
        },
        {
          "name": "Autovalori ed autovettori di matrici simmetriche e definite positive",
          "done": false
        },
        {
          "name": "Metodo delle potenze e delle potenze inverse",
          "done": false
        },
        {
          "name": "Quoziente di Rayleigh",
          "done": false
        },
        {
          "name": "Metodo di trasformazione QR",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Studiare le applicazioni degli autovalori in problemi pratici."
        }
      ],
      "links": []
    }
  ],
  "urls": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "icon": "mdi-book-open-page-variant",
  "color": "#4caf50",
  "examMode": "L'esame è composto da una parte orale e da prove in laboratorio con l'uso di Matlab.Per gli studenti frequentanti l'esame si compone di due parti: una prova orale e due prove pratiche in laboratorio informatico. La prima prova di laboratorio si svolgerà durante le ore di esercitazioni mentre la seconda avrà luogo alla fine del corso con modalità da concordare con gli studenti. Gli studenti dovranno risolvere 3 o 4 esercizi sviluppando un codice simile a quelli visti durante le esercitazioni. La prova sarà ritenuta sufficiente se saranno svolti in maniera soddisfacente almeno 2 esercizi. Per ogni esercizio verrà data una valutazione nella scala: Insufficiente, Sufficiente, Discreto, Buono, Molto Buono, Ottimo.Se l'esito della prova pratica è positivo sarà tenuto valido per tutte le sessioni d'esame. Per gli studenti che non partecipano alle prove pratiche durante il corso, saranno predisposte prove pratiche in laboratorio durante tutte le sessioni d'esame comprendenti tutti gli argomenti del corso.",
  "requirements": "Analisi Matematica I, Analisi Matematica II, Algebra e Geometria",
  "cfu": "6 CFU",
  "language": "ITALIANO",
  "teachers": [
    {
      "name": ""
    }
  ],
  "books": {
    "books": [
      {
        "name": "Calcolo scientifico: esercizi e problemi risolti con MATLAB e Octave",
        "authors": [
          "Alfio Quarteroni",
          "Fausto Saleri",
          "Paola Gervasio"
        ],
        "year": 2017,
        "notes": [
          "6th edition",
          "Check availability in the catalog"
        ]
      }
    ]
  }
}