{
  "id": "unibs703039",
  "universityId": "unibs",
  "name": "MECCANICA RAZIONALE",
  "lastUpdated": "2024-08-26T14:52:25.390Z",
  "deleted": null,
  "goals": "Il corso è rivolto a studenti del secondo anno ed illustra i modelli matematici atti ad interpretare e descrivere un ampio spettro di fenomeni relativi al moto dei sistemi materiali vincolati, rigidi ed articolati.Conoscenza e ComprensioneConoscenza dei principi fondamentali della meccanica e la loro applicazione.Lo studente alla fine del corso conoscerà i principali metodi per la modellizzazione matematica di sistemi materiali allo scopo di determinare i parametri che ne caratterizzano le condizioni di equilibrio e le equazioni differenziali di moto.Capacità di applicare conoscenza e comprensioneLo studente sarà in grado di utilizzare i metodi matematici per la risoluzione di problemi meccanici ad uno o a più gradi di libertà.Autonomia di GiudizioLo studente alla fine del Corso avrà acquisito la capacità di determinare in forma autonoma quali leggi fisiche e modelli matematici applicare ai problemi meccanici e saprà analizzare e di formalizzare problemi per lui nuovi.Abilità comunicativeSaper usare il linguaggio specifico e formale per descrivere sistemi fisici.Lo studente dovrà acquisire la capacità di esporre in modo chiaro e rigoroso, utilizzandoadeguatamente il lessico disciplinare, i risultati dell'analisi del problema e dellesoluzioni qualitative individuate.Capacità di ApprendimentoLo studente risolvendo problemi ed esercizi, consultando testi ed altre fonti, migliorerà la capacità di apprendimento e di sviluppo del pensiero autonomo.",
  "chapters": [
    {
      "name": "Cinematica dei sistemi materiali e moti relativi",
      "showTasks": true,
      "tasks": [
        {
          "name": "Moto di un punto: velocità ed accelerazione",
          "done": false
        },
        {
          "name": "Moti particolari (piano, centrale, circolare, armonico, ecc.)",
          "done": false
        },
        {
          "name": "Vincoli e sistemi olonomi",
          "done": false
        },
        {
          "name": "Cinematica dei sistemi rigidi",
          "done": false
        },
        {
          "name": "Angoli di Eulero",
          "done": false
        },
        {
          "name": "Atto di moto rigido",
          "done": false
        },
        {
          "name": "Formule di Poisson",
          "done": false
        },
        {
          "name": "Teorema di Mozzi con applicazioni",
          "done": false
        },
        {
          "name": "Cinematica dei moti relativi",
          "done": false
        },
        {
          "name": "Moti rigidi piani con esempi",
          "done": false
        },
        {
          "name": "Traiettorie polari: base e rulletta",
          "done": false
        },
        {
          "name": "Moto di un corpo rigido con punto fisso: coni di Poinsot",
          "done": false
        },
        {
          "name": "Moti di precessione regolare",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#f44336",
          "content": "Studiando il moto di un punto, è utile visualizzare con grafici le diverse traiettorie."
        }
      ],
      "links": []
    },
    {
      "name": "Principi ed equazioni fondamentali della dinamica",
      "showTasks": true,
      "tasks": [
        {
          "name": "Massa, forza e leggi di Newton",
          "done": false
        },
        {
          "name": "Proprietà dei sistemi inerziali",
          "done": false
        },
        {
          "name": "Forze costitutive e lavoro",
          "done": false
        },
        {
          "name": "Principio di Dissipazione dell'Energia Meccanica",
          "done": false
        },
        {
          "name": "Forze conservative e potenziali",
          "done": false
        },
        {
          "name": "Equazioni differenziali del moto e Principio delle Reazioni Vincolari",
          "done": false
        },
        {
          "name": "Teoremi della quantità di moto e forze vive",
          "done": false
        },
        {
          "name": "Teorema di conservazione dell'energia meccanica",
          "done": false
        },
        {
          "name": "Integrali primi del moto",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#2196f3",
          "content": "Rivedere i teoremi della quantità di moto per chiarire i concetti."
        }
      ],
      "links": []
    },
    {
      "name": "Geometria delle masse e grandezze cinetiche",
      "showTasks": true,
      "tasks": [
        {
          "name": "Nozioni sui vettori applicati",
          "done": false
        },
        {
          "name": "Baricentri e loro proprietà",
          "done": false
        },
        {
          "name": "Espressione della quantità di moto",
          "done": false
        },
        {
          "name": "Teoremi di Koenig per l'energia cinetica",
          "done": false
        },
        {
          "name": "Espressione dell'energia cinetica e momento della quantità di moto",
          "done": false
        },
        {
          "name": "Teorema di Huygens-Steiner",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#ff9800",
          "content": "Confronta le proprietà dei baricentri nei diversi sistemi."
        }
      ],
      "links": []
    },
    {
      "name": "Equazioni cardinali della meccanica dei sistemi rigidi ed articolati",
      "showTasks": true,
      "tasks": [
        {
          "name": "Equazioni cardinali per sistemi materiali rigidi",
          "done": false
        },
        {
          "name": "Caratterizzazione delle reazioni di vincoli",
          "done": false
        },
        {
          "name": "Statica dei corpi rigidi con applicazioni",
          "done": false
        },
        {
          "name": "Dinamica dei sistemi materiali rigidi con applicazioni",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#9c27b0",
          "content": "Rivedi i concetti di svincolamento statico."
        }
      ],
      "links": []
    },
    {
      "name": "Cenni di meccanica analitica",
      "showTasks": true,
      "tasks": [
        {
          "name": "Relazione simbolica della dinamica e Principio di D'Alembert",
          "done": false
        },
        {
          "name": "Relazione simbolica della statica e Principio dei Lavori Virtuali",
          "done": false
        },
        {
          "name": "Condizioni di equilibrio per un sistema olonomo",
          "done": false
        },
        {
          "name": "Equazioni di Lagrange per sistemi olonomi",
          "done": false
        },
        {
          "name": "Sistemi olonomi conservativi e funzione di Lagrange",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#607d8b",
          "content": "Studia le differenze tra sistemi olonomi e non olonomi."
        }
      ],
      "links": []
    }
  ],
  "urls": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "icon": "mdi-physics",
  "color": "#4caf50",
  "examMode": "L’esame è volto ad accertare la conoscenza degli argomenti elencati nel Programma ufficiale del Corso e la capacità di applicare la teoria ed i suoi metodi alla soluzione di esercizi. Per ogni iscritto l’esame è costituito da uno scritto, con esercizi e quesiti anche teorici a risposta chiusa e/o a risposta aperta, proposti su piattaforma Moodle. Le valutazioni sono espresse in trentesimi. In coda al testo di ogni quesito è scritto il punteggio che si acquisisce nel caso di risposta corretta. Ogni risposta non data vale 0 punti.Per ogni risposta errata si sottrae il 20% del punteggio complessivo del dato esercizio.Una votazione della prova inferiorea 18/30 è considerata insufficiente. Durante l'esame non si possono portare in aula libri di alcun tipo o appunti del corso. Può essere consentito l’uso di una calcolatrice non programmabile.L’esame è rivolto ad accertare la capacità di risoluzione di quesiti e calcoli (sia simboliciche numerici) inerenti gli argomenti trattati nel corso. La prova è articolata in esercizi anche con più domande estese. Gli esercizi avranno un livello di difficoltà non superiore al livello degli esercizi svolti nel corso delle Esercitazioni e si ispireranno agliesercizi ed agli esempi del libro/libri di testo consigliato/i dalla docente. I libri saranno indicati dalla docente all’inizio del corso. In generale i quesiti saranno prevalentemente rivoltiad accertare una adeguata conoscenza della teoria discussa nel corso. Gli argomenti di teoria discussi durante il corso sono elencati nel Programma del Corso.",
  "requirements": "Analisi Matematica I, Algebra e Geometria",
  "cfu": "6 CFU",
  "language": "ITALIANO",
  "teachers": [
    {
      "name": "ARCHETTI MILENA"
    },
    {
      "name": "ANNESE MICHELE"
    }
  ],
  "books": {
    "books": [
      {
        "name": "Elementi di meccanica classica",
        "authors": [
          "Mauro Fabrizio"
        ],
        "year": 2002,
        "notes": [
          "Available at Zanichelli",
          "Check catalog for availability"
        ]
      },
      {
        "name": "Esercizi e temi d'esame di meccanica razionale",
        "authors": [
          "Augusto Muracchini",
          "Francesca Brini"
        ],
        "year": 2019,
        "notes": [
          "5th edition",
          "Available at Esculapio",
          "Check catalog for availability"
        ]
      },
      {
        "name": "Meccanica razionale",
        "authors": [
          "Paolo Biscari"
        ],
        "year": 2022,
        "notes": [
          "4th edition",
          "Available at Springer",
          "Check catalog for availability"
        ]
      }
    ]
  }
}