{
  "id": "unibs703041",
  "universityId": "unibs",
  "course": "CORSO DI LAUREA IN INGEGNERIA MECCANICA E DEI MATERIALI",
  "name": "METALLURGIA  Cognomi M Z",
  "lastUpdated": "2024-08-26T15:17:32.581Z",
  "deleted": null,
  "goals": "L'insegnamento si propone l'obiettivo di fornire le conoscenze di base relative alle principali categorie di materiali metallici di impiego ingegneristico, ponendo una particolare attenzione agli acciai, così da saper valutare le proprietà che ne descrivono il comportamento meccanico e saper correlare quest'ultimo con la microstruttura. Sulla base di tali conoscenze e di quelle relative ai possibili cedimenti in esercizio ai quali possono andare soggetti i manufatti realizzati con i materiali metallici (fatica, fragilità, corrosione, usura e scorrimento viscoso) gli studenti saranno in grado di effettuare una scelta di massima di un materiale metallico e dei trattamenti termici da adottare per soddisfare specifiche condizioni di impiego per un determinato manufatto. Gli studenti aumenteranno la loro capacità di esprimersi con un linguaggio tecnico scientifico proprio delle scienze ingegneristiche e consolideranno la capacità di consultare e utilizzare materiale bibliografico e banche dati utili per un aggiornamento continuo delle conoscenze.",
  "chapters": [
    {
      "name": "Fondamenti di Metallurgia",
      "showTasks": true,
      "tasks": [
        {
          "name": "Reticoli cristallini e Difetti",
          "done": false
        },
        {
          "name": "Solidificazione dei metalli e delle leghe",
          "done": false
        },
        {
          "name": "Diagrammi di stato delle leghe metalliche",
          "done": false
        },
        {
          "name": "Prove meccaniche",
          "done": false
        },
        {
          "name": "Trasformazioni di fase e modifiche microstrutturali",
          "done": false
        },
        {
          "name": "Trattamenti termici",
          "done": false
        },
        {
          "name": "Meccanismi di rafforzamento",
          "done": false
        },
        {
          "name": "Fenomeni di cedimento in esercizio",
          "done": false
        },
        {
          "name": "Cenni sulla produzione dell'acciaio",
          "done": false
        },
        {
          "name": "Gli acciai: Proprietà e designazione",
          "done": false
        },
        {
          "name": "Le ghise: Strutture e classificazione",
          "done": false
        },
        {
          "name": "Le leghe non ferrose",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Approfondire i meccanismi di indurimento e le trasformazioni polimorfe."
        },
        {
          "color": "#e64a19",
          "content": "Studiare in dettaglio i diagrammi di stato, in particolare il diagramma Fe-C."
        },
        {
          "color": "#03a9f4",
          "content": "Rivedere i metodi di prova meccanica e le loro applicazioni pratiche."
        }
      ],
      "links": []
    }
  ],
  "urls": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "icon": "mdi-book-open",
  "color": "#7b1fa2",
  "examMode": "La verifica dell’apprendimento si svolge attraverso due prove scritte in itinere di carattere facoltativo o con una prova finale di norma scritta al termine del corso. L'esame è superato se la media delle prove in itinere o la prova finale scritta risultano sufficienti (18/30).Per ottenere un esito positivo all’esame, è necessario che lo studente dimostri di conoscere e comprendere gli argomenti trattati durante il corso e in particolare le teorie e i principi fondamentali della metallurgia, i metodi necessari alla produzione e caratterizzazione dei materiali metallici, con particolare riferimento agli acciai. È necessario, inoltre, che lo studente sappia risolvere esercizi, interpretare ed utilizzare i diagrammi presentati nel corso delle lezioni o delle esercitazioni (diagrammi di fase, curve TTT, curve CCT, etc.). È necessario, infine, che lo studente sia in grado discutere gli aspetti fondamentali dell’insegnamento con adeguata chiarezza espositiva e utilizzando la terminologia appropriata. Il calendario delle prove viene comunicato con sufficiente anticipo dal docente e reso disponibile sulla piattaforma web.",
  "requirements": "Il superamento dell’esame di Chimica Generale è un prerequisito obbligatorio all’apprendimento dei contenuti del corso.",
  "cfu": "9 CFU",
  "language": "ITALIANO",
  "teachers": [
    {
      "name": "MONTESANO LORENZO"
    },
    {
      "name": "GHIDINI LORENZO"
    },
    {
      "name": "MERICO PAOLOMARCO"
    }
  ],
  "books": {
    "books": [
      {
        "name": "Acciai e leghe non ferrose",
        "authors": [
          "Walter Nicodemi"
        ],
        "year": 2008,
        "notes": [
          "2. ed",
          "Bologna : Zanichelli"
        ]
      },
      {
        "name": "Metallurgia",
        "authors": [
          "Walter Nicodemi"
        ],
        "year": 2007,
        "notes": [
          "2. ed",
          "Bologna : Zanichelli"
        ]
      },
      {
        "name": "Metallurgia degli acciai",
        "authors": [
          "Marco V. Boniardi",
          "Andrea Casaroli"
        ],
        "year": 2022,
        "notes": [
          "Esine : Lucefin",
          "Published between 2017-2022"
        ]
      },
      {
        "name": "Scienza e ingegneria dei materiali: una introduzione",
        "authors": [
          "William D. Callister, Jr.",
          "Claudio Caneva (ed.)"
        ],
        "year": 2008,
        "notes": [
          "2. ed",
          "Napoli : EdiSES"
        ]
      }
    ]
  }
}