{
  "id": "unibs703041",
  "universityId": "unibs",
  "course": "CORSO DI LAUREA IN INGEGNERIA MECCANICA E DEI MATERIALI",
  "name": "METALLURGIA  Cognomi A L",
  "lastUpdated": "2024-08-26T15:17:29.963Z",
  "deleted": null,
  "goals": "L'insegnamento si propone di fornire una conoscenza generale delle proprietà dello stato metallico, in confronto con quelle degli altri materiali di impiego ingegneristico. L'insegnamento, pertanto, prevede una trattazione dei diagrammi di stato delle leghe, dei trattamenti termici sia massivi che superficiali, dei metodi di indagine delle proprietà dei materiali metallici, un inquadramento razionale dei metalli e delle leghe di interesse industriale in base alle proprietà meccaniche e fisiche; viene fatto anche cenno ai principali processi di produzione dei vari materiali, con enfasi a quelli di acciaio e ghisa, visti nei riflessi sulle proprietà, sui costi di produzione e sul costo del ciclo di vita. Sulla base di queste conoscenze, lo studente sviluppa la capacità di valutare le strette correlazioni tra struttura e proprietà meccaniche dei materiali metallici in funzione del processo produttivo e delle condizioni di esercizio, al fine di apprendere i criteri di scelta e di controllo dei materiali metallici, soprattutto per quanto riguarda gli acciai. Lo studente aumenterà la sua capacità di esprimersi con un linguaggio tecnico scientifico proprio delle scienze ingegneristiche e consoliderà la capacità di consultare e utilizzare materiale bibliografico e banche dati utili per un aggiornamento continuo delle conoscenze.",
  "chapters": [
    {
      "name": "Fondamenti della Metallurgia",
      "showTasks": true,
      "tasks": [
        {
          "name": "Reticoli cristallini e notazioni cristallografiche",
          "done": false
        },
        {
          "name": "Difetti reticolari",
          "done": false
        },
        {
          "name": "Soluzioni solide e composti intermetallici",
          "done": false
        },
        {
          "name": "Diffusione allo stato solido",
          "done": false
        },
        {
          "name": "Trasformazioni polimorfe",
          "done": false
        },
        {
          "name": "Solidificazione dei metalli e leghe",
          "done": false
        },
        {
          "name": "Diagrammi di stato delle leghe metalliche",
          "done": false
        },
        {
          "name": "Prove meccaniche",
          "done": false
        },
        {
          "name": "Trasformazioni di fase",
          "done": false
        },
        {
          "name": "Trattamenti termici",
          "done": false
        },
        {
          "name": "Meccanismi di rafforzamento",
          "done": false
        },
        {
          "name": "Fenomeni di cedimento in esercizio",
          "done": false
        },
        {
          "name": "Cenni sulla produzione dell’acciaio",
          "done": false
        },
        {
          "name": "Gli acciai",
          "done": false
        },
        {
          "name": "Le ghise",
          "done": false
        },
        {
          "name": "Le leghe non ferrose",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Comprendere i meccanismi di danneggiamento in relazione alle sollecitazioni e all'ambiente."
        }
      ],
      "links": []
    }
  ],
  "urls": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "icon": "mdi-book-open-variant",
  "color": "#3f5aab",
  "examMode": "La verifica dell’apprendimento si svolge attraverso due prove scritte in itinere di carattere facoltativo o con una prova finale di norma scritta al termine del corso. L'esame è superato se la media delle prove in itinere o la prova finale scritta risultano sufficienti (18/30).Per ottenere un esito positivo all’esame, è necessario che lo studente dimostri di conoscere e comprendere gli argomenti trattati durante il corso e in particolare le teorie e i principi fondamentali della metallurgia, i metodi necessari alla produzione e caratterizzazione dei materiali metallici, con particolare riferimento agli acciai. È necessario, inoltre, che lo studente sappia risolvere esercizi, interpretare ed utilizzare i diagrammi presentati nel corso delle lezioni o delle esercitazioni (diagrammi di fase, curve TTT, curve CCT, etc.). È necessario, infine, che lo studente sia in grado discutere gli aspetti fondamentali dell’insegnamento con adeguata chiarezza espositiva e utilizzando la terminologia appropriata. Il calendario delle prove viene comunicato con sufficiente anticipo dal docente e reso disponibile sulla piattaforma web.",
  "requirements": "Il superamento dell’esame di Chimica Generale è un prerequisito obbligatorio all’apprendimento dei contenuti del corso.",
  "cfu": "9 CFU",
  "language": "ITALIANO",
  "teachers": [
    {
      "name": "MONTESANO LORENZO"
    },
    {
      "name": "ABRAMI MARIA-BEATRICE"
    },
    {
      "name": "DELIBASHI BOJKEN"
    },
    {
      "name": "MARCHINI LUCA"
    }
  ],
  "books": {
    "books": [
      {
        "name": "Acciai e leghe non ferrose",
        "authors": [
          "Walter Nicodemi"
        ],
        "year": 2008,
        "notes": [
          "2. ed",
          "Bologna : Zanichelli"
        ]
      },
      {
        "name": "Metallurgia",
        "authors": [
          "Walter Nicodemi"
        ],
        "year": 2007,
        "notes": [
          "2. ed",
          "Bologna : Zanichelli"
        ]
      },
      {
        "name": "Metallurgia degli acciai",
        "authors": [
          "Marco V. Boniardi",
          "Andrea Casaroli"
        ],
        "year": 2017,
        "notes": [
          "Esine : Lucefin",
          "2017-2022"
        ]
      },
      {
        "name": "Scienza e ingegneria dei materiali: una introduzione",
        "authors": [
          "William D. Callister, Jr.",
          "Claudio Caneva (edizione italiana a cura di)"
        ],
        "year": 2008,
        "notes": [
          "2. ed",
          "Napoli : EdiSES"
        ]
      }
    ]
  }
}