{
  "id": "unibsA003495",
  "universityId": "unibs",
  "name": "LABORATORIO DI MATERIALI POLIMERICI PROPRIETA  MECCANICHE",
  "lastUpdated": "2024-08-26T14:53:34.465Z",
  "deleted": null,
  "goals": "Il corso mira a far sì che gli studenti acquisiscano competenze relativamente alle tecniche di laboratorio per la misurazione delle principali proprietà meccaniche dei materiali polimerici, con riferimento agli aspetti di base e a quelli più propriamente metodologici e strumentali. Al termine dell'insegnamento, lo studente sarà in grado di programmare prove meccaniche di laboratorio di base con strumenti standard, raccogliere ed interpretare i dati. Sarà altresì in grado di analizzare i bollettini tecnici dei materiali polimerici e di utilizzare i dati in essi contenuti in modo tale da delinearne il comportamento.",
  "chapters": [
    {
      "name": "Proprietà meccaniche dei materiali polimerici",
      "showTasks": true,
      "tasks": [
        {
          "name": "Introduzione alle proprietà meccaniche",
          "done": false
        },
        {
          "name": "Normative di riferimento",
          "done": false
        },
        {
          "name": "Tecniche sperimentali di misurazione",
          "done": false
        },
        {
          "name": "Prove di trazione, compressione e flessione al dinamometro",
          "done": false
        },
        {
          "name": "Prove di impatto non-strumentato e strumentato",
          "done": false
        },
        {
          "name": "Analisi dei bollettini tecnici",
          "done": false
        },
        {
          "name": "Banche dati di materiali polimerici",
          "done": false
        },
        {
          "name": "Presentazione dei dati e analisi statistica",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Esaminare gli aspetti strumentali della misura delle proprietà meccaniche."
        },
        {
          "color": "#e6b905",
          "content": "Raccogliere bullettini tecnici per il riferimento."
        }
      ],
      "links": []
    }
  ],
  "urls": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "icon": "mdi-book-open",
  "color": "#FFA07A",
  "examMode": "L'esame è volto ad accertare la conoscenza degli argomenti riportati nel Programma esteso del corso. Sarà inoltre verificata la capacità dello studente di pianificare prove di laboratorio sui materiali polimerici, e di reperire ed analizzare bollettini tecnici di materiali di interesse industriale. L'esame consiste in una prova orale, e si può svolgere contestualmente a quello del modulo di \"Laboratorio di materiali polimerici - Proprietà termiche e di processo\" (v. relativa scheda). A ciascun iscritto sarà richiesto di presentare e discutere una relazione (\"quaderno di laboratorio\") sviluppata sulla base dei risultati ottenuti nelle esercitazioni di laboratorio svolte durante il corso, in modo da verificare la capacità dello studente di raccogliere, elaborare e presentare dati acquisiti in prove standard di laboratorio. Agli studenti che non frequenteranno le esercitazioni in laboratorio, sarà richiesto di presentare una breve relazione su una specifica tecnica di laboratorio preventivamente concordata col docente.",
  "requirements": "Per la fruizione dell'insegnamento sono necessarie le competenze acquisibili frequentando l'insegnamento di \"Scienza e tecnologia dei materiali\" (II anno).",
  "cfu": "3 CFU",
  "language": "ITALIANO",
  "teachers": [
    {
      "name": "AGNELLI JACOPO"
    }
  ],
  "books": {
    "books": [
      {
        "name": "Principles of Polymer Engineering",
        "authors": [
          "N. G. McCrum",
          "C. P. Buckley",
          "C. B. Bucknall"
        ],
        "year": 1997,
        "notes": [
          "2nd edition",
          "Published by Oxford University Press in New York"
        ]
      },
      {
        "name": "La plastica : conoscerla per apprezzarla",
        "authors": [
          "Giancarlo Locati",
          "Arturo Fiocca"
        ],
        "year": 2016,
        "notes": [
          "Published by Pacini in Ospedaletto, Pisa and Rivalta Scrivia",
          "Collaboration with Proplast and Federazione gomma plastica, Unionplast"
        ]
      }
    ]
  }
}