{
  "id": "unibsA005021",
  "universityId": "unibs",
  "name": "LA GOMMA  DALLE MESCOLE AL PRODOTTO FINITO",
  "lastUpdated": "2024-08-26T14:53:36.936Z",
  "deleted": null,
  "goals": "Il corso si propone di completare la formazione degli studenti su un materiale, la gomma, largamente usato in diverse applicazioni ingegneristiche quali pneumatici o sistemi di tenuta, in accordo con gli obiettivi del corso di laurea in Ingegneria per l'Innovazione dei Materiali e del Prodotto. Per aumentare la conoscenza della realtà industriale della gomma, sono previsti interventi di professionisti che operano in imprese del settore.A seguito del superamento dell'esame, lo studente: - conoscerà gli ingredienti tipici di una mescola e le caratteristiche strutturali delle gomme, e come queste si relazionano alle sue proprietà;- conoscerà le proprietà fisco-meccaniche specifiche di una gomma e come vengono misurate;- conoscerà le tecnologie di lavorazione dei suddetti materiali;- avrà la capacità di saper valutare criticamente le principali proprietà fisico-meccaniche della gomma, in modo da potere prevedere il suo comportamento in esercizio ed effettuare autonomamente una prima selezione della mescola più adatta in funzione dell'applicazione;- sarà in grado di dimensionare degli O-ring per sistemi di tenuta statica;- sarà in grado di proporre modifiche alla formulazione di una mescola, almeno per quello che riguarda i componenti principali, per l'ottenimento delle proprietà volute;- sarà in grado di formulare delle ipotesi in merito alle cause del cattivo funzionamento in un componente in gomma;- avrà la capacità di esprimere concetti, interpretazioni e idee in forma orale e/o scritta e/o grafica relativamente alle tematiche del corso;- avrà la capacità di consultare e utilizzare materiale bibliografico e informazioni in rete per apprendere nuove conoscenze sulle tematiche del corso.",
  "chapters": [
    {
      "name": "Introduzione alla scienza e tecnologia della gomma",
      "showTasks": true,
      "tasks": [
        {
          "name": "Comprendere la composizione e selezione di una mescola di gomma",
          "done": false
        },
        {
          "name": "Caratterizzare le proprietà fisico-meccaniche delle gomme",
          "done": false
        },
        {
          "name": "Studiare le principali tecnologie di produzione di manufatti in gomma",
          "done": false
        },
        {
          "name": "Analizzare esempi di utilizzo della gomma (pneumatici e sistemi di tenuta)",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "La gomma ha applicazioni in diversi settori industriali."
        }
      ],
      "links": []
    },
    {
      "name": "Tipologie di materiali elastomerici",
      "showTasks": true,
      "tasks": [
        {
          "name": "Esplorare le principali tipologie di materiali elastomerici presenti sul mercato",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#ff9900",
          "content": "Le tipologie di materiali influenzano le proprietà finali del prodotto."
        }
      ],
      "links": []
    },
    {
      "name": "Sistemi di vulcanizzazione",
      "showTasks": true,
      "tasks": [
        {
          "name": "Studiare i sistemi di vulcanizzazione e cariche rinforzanti",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#00cc99",
          "content": "La vulcanizzazione è fondamentale per la stabilità e durevolezza della gomma."
        }
      ],
      "links": []
    },
    {
      "name": "Criteri di selezione degli ingredienti della mescola",
      "showTasks": true,
      "tasks": [
        {
          "name": "Analizzare i criteri di selezione degli ingredienti della mescola in funzione dell’applicazione finale",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#ff6699",
          "content": "La selezione degli ingredienti varia con l'uso finale della gomma."
        }
      ],
      "links": []
    },
    {
      "name": "Proprietà termo-meccaniche della gomma",
      "showTasks": true,
      "tasks": [
        {
          "name": "Studiare le proprietà delle mescole crude",
          "done": false
        },
        {
          "name": "Comprendere l'elasticità e il comportamento meccanico della gomma",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#6699ff",
          "content": "Le proprietá termo-meccaniche sono cruciali per le applicazioni di gomma."
        }
      ],
      "links": []
    },
    {
      "name": "Proprietà di resistenza ambientale della gomma",
      "showTasks": true,
      "tasks": [
        {
          "name": "Esaminare le proprietà di resistenza ambientale della gomma",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#cc00cc",
          "content": "La resistenza ambientale è importante per la durabilità delle applicazioni."
        }
      ],
      "links": []
    },
    {
      "name": "Processi di trasformazione della gomma",
      "showTasks": true,
      "tasks": [
        {
          "name": "Studiare i processi di trasformazione della gomma",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#ffccff",
          "content": "I processi di trasformazione determinano la forma finale dei prodotti."
        }
      ],
      "links": []
    },
    {
      "name": "Applicazioni ingegneristiche della gomma",
      "showTasks": true,
      "tasks": [
        {
          "name": "Analizzare case studies su sistemi di tenuta e pneumatici",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#009966",
          "content": "Studiare esempi concreti di applicazione aiuta a comprendere la teoria."
        }
      ],
      "links": []
    },
    {
      "name": "Riciclo della gomma",
      "showTasks": true,
      "tasks": [
        {
          "name": "Studiare il riciclo della gomma",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#ff3300",
          "content": "Il riciclo della gomma è importante per la sostenibilità."
        }
      ],
      "links": []
    },
    {
      "name": "Visita a un impianto di produzione di articoli tecnici in gomma",
      "showTasks": true,
      "tasks": [
        {
          "name": "Partecipare alla visita all'impianto di produzione",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#3300cc",
          "content": "Le visite pratiche offrono una grande opportunità di apprendimento."
        }
      ],
      "links": []
    }
  ],
  "urls": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "icon": "mdi-rubber",
  "color": "#ffcc00",
  "examMode": "L’esame è volto ad accertare la conoscenza degli argomenti elencati nel Programma ufficiale del Corso e la capacità di applicare i concetti teorici appresi a casi applicativi pratici.L'esame consiste in una prova scritta, con un mix di domande aperte, chiuse, ed esercizi, in cui si valuterà la capacità di descrivere il comportamento fisico-meccanico di una gomma, di relazionarlo alla sua composizione, e di saperlo utilizzare per la scelta più idonea del processo produttivo.Necessario al superamento dell’esame è un corretto utilizzo della terminologia.L’esame orale è considerato sufficiente con una votazione di almeno 18/30.",
  "requirements": "E’ necessario aver acquisito il corso di “Scienza e Tecnologia dei Materiali” o \"Scienza e Tecnologia dei Polimeri e dei Compositi\"",
  "cfu": "3 CFU",
  "language": "ITALIANO",
  "teachers": [
    {
      "name": ""
    }
  ],
  "books": {
    "books": [
      {
        "name": "Rubber Technologist's Handbook",
        "authors": [
          "J. R. White",
          "Sadhan K. De"
        ],
        "year": null,
        "notes": [
          "Available in electronic version",
          "Published by Rapra Technology Limited"
        ]
      },
      {
        "name": "An Introduction to Rubber Technology",
        "authors": [
          "Andrew Ciesielski"
        ],
        "year": null,
        "notes": [
          "Available in electronic version",
          "Published by Rapra Technology Limited"
        ]
      },
      {
        "name": "Engineering with Rubber: How to Design Rubber Components",
        "authors": [
          "Alan N. Gent"
        ],
        "year": null,
        "notes": [
          "Available in electronic version"
        ]
      },
      {
        "name": "Physical Testing of Rubber",
        "authors": [
          "Roger Brown"
        ],
        "year": null,
        "notes": [
          "Available in electronic version"
        ]
      }
    ]
  }
}