{
  "id": "unibsA003914",
  "universityId": "unibs",
  "course": "CORSO DI LAUREA IN INGEGNERIA MECCANICA E DEI MATERIALI",
  "name": "LABORATORIO DI TRASMISSIONE DEL CALORE",
  "lastUpdated": "2024-08-26T15:18:53.929Z",
  "deleted": null,
  "goals": "La simulazione numerica è uno strumento importante nell'attività di ricerca, sviluppo ed ottimizzazione in tutti i settori dell'ingegneria: software di varie tipologie sono strumenti di uso quotidiano in aziende e studi di ingegneria. L'obiettivo del corso è quello di introdurre lo studente all'uso di un software specialistico per la soluzione di problemi ingegneristici. Il codice scelto è OpenFOAM, un codice opensource, che si sta diffondendo rapidamente sia in ambito accademico che industriale grazie all'eliminazione dei costi annuali di licenza e nonostante un'interfaccia poco user-friendly. Al termine del corso lo studente avrà acquisito le competenze necessarie per impostare un problema di scambio termico di moderata complessità in OpenFOAM e per ottenerne una soluzione numerica. Userà infine le conoscenze di scambio termico acquisite in corsi precedenti e richiamate nelle lezioni frontali per interpretare i risultati ottenuti.",
  "chapters": [
    {
      "name": "Introduzione all'uso di OpenFOAM",
      "showTasks": true,
      "tasks": [
        {
          "name": "Introduzione all'uso del software OpenFOAM",
          "done": false
        },
        {
          "name": "Impostazione di un problema",
          "done": false
        },
        {
          "name": "Griglia",
          "done": false
        },
        {
          "name": "Risoluzione",
          "done": false
        },
        {
          "name": "Analisi dei risultati",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Comprendere la struttura e l'interfaccia di OpenFOAM è cruciale."
        }
      ],
      "links": []
    },
    {
      "name": "Richiami di scambio termico",
      "showTasks": true,
      "tasks": [
        {
          "name": "Richiami di scambio termico per conduzione e/o irraggiamento",
          "done": false
        },
        {
          "name": "Conduzione in regime stazionario: problemi a più dimensioni",
          "done": false
        },
        {
          "name": "Conduzione in regime non stazionario",
          "done": false
        },
        {
          "name": "Irraggiamento",
          "done": false
        },
        {
          "name": "Problemi di scambio combinato (conduttivo/radiativo)",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Rivedere i fondamenti di conduzione e irraggiamento."
        }
      ],
      "links": []
    },
    {
      "name": "Introduzione ai metodi numerici",
      "showTasks": true,
      "tasks": [
        {
          "name": "Principali metodi per la soluzione dell'equazione della conduzione",
          "done": false
        },
        {
          "name": "Principali metodi per la soluzione di problemi di irraggiamento",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Esplorare i metodi numerici più comuni utilizzati in scambio termico."
        }
      ],
      "links": []
    },
    {
      "name": "Esempio pratico",
      "showTasks": true,
      "tasks": [
        {
          "name": "Risoluzione con OpenFOAM del transitorio successivo al contatto fra corpi inizialmente a temperatura differente",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Questo esempio aiuterà a capire il comportamento del sistema al variare delle condizioni iniziali."
        }
      ],
      "links": []
    },
    {
      "name": "Progetto svolto dall'allievo",
      "showTasks": true,
      "tasks": [
        {
          "name": "Sviluppo del progetto",
          "done": false
        }
      ],
      "postIts": [
        {
          "color": "#e6b905",
          "content": "Seguire le linee guida fornite per completare il progetto."
        }
      ],
      "links": []
    }
  ],
  "urls": [
    {
      "name": "syllabus",
      "url": "https://unibs.coursecatalogue.cineca.it/insegnamenti/2023/8249_122421_8338/2022/8251/81?coorte=2023&schemaid=2493"
    }
  ],
  "icon": "mdi:book-open-variant",
  "color": "#4a90e2",
  "examMode": "Durante il corso lo studente dovrà sviluppare un progetto, scelto assieme al docente, che consisterà nella soluzione con OpenFOAM di un problema di scambio termico di moderata complessità. Il problema, la sua impostazione e i risultati ottenuti verranno descritti in una sintetica relazione finale scritta che verrà consegnata, presentata e discussa durante l'esame orale.",
  "requirements": "Nozioni elementari di scambio termico per conduzione ed irraggiamento, usualmente fornite nei corsi di Fisica Tecnica nei corsi di laurea di Ingegneria.",
  "cfu": "3 CFU",
  "language": "ITALIANO",
  "teachers": [
    {
      "name": ""
    }
  ],
  "books": {
    "books": [
      {
        "name": "Fondamenti di trasmissione del calore",
        "authors": [
          "Gianni Comini",
          "Giovanni Cortella"
        ],
        "year": 2005,
        "notes": [
          "3rd edition, revised and expanded",
          "Recommended for course studies",
          "Check availability in the catalog"
        ]
      }
    ]
  }
}